# 1. Basi Pandas

In [1]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df = pd.DataFrame(dict1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 2. Display Top 3 Row Of The Dataset

In [2]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 3. Display Last 3 Row Of The Dataset

In [3]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 4. Find Shape of Our Dataset(Number of row and Number of columns)

In [5]:
df.shape

(7, 3)

In [6]:
print('Number of Rows : ', df.shape[0])
print('Number of Columns : ', df.shape[1])

Number of Rows :  7
Number of Columns :  3

# 5. Get Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

# 6. Check Null Values in the Dataset

In [8]:
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [9]:
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [12]:
df.isnull().sum(axis=0) # row waise

Name      0
Marks     0
Gender    0
dtype: int64

In [13]:
df.isnull().sum(axis=1) # column waise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# 7. Get Overall Statistics About The DataFrame

In [16]:
df.describe()  # By default describe performe only numerical column

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [17]:
df.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# 8. Find Unique Values From The Gender Column

In [18]:
df.nunique()

Name      7
Marks     6
Gender    2
dtype: int64

In [24]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# 9. Find the Number of Unique Values from the Gender column

In [25]:
df['Gender'].nunique()

2

# 10. Display Count of Unique Values in Gender Column

In [26]:
df['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

# 11. Find Total Number of Students Having Marks Between 90 To 100(Inclusive) Using Between Method.

In [29]:
df[(df['Marks'] >= 90) & (df['Marks'] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [34]:
len(df[(df['Marks'] >= 90) & (df['Marks'] <= 100)])

4

In [37]:
sum(df['Marks'].between(90, 100))

4

# 12.Find Average, Min, Max Marks

In [39]:
sum(df['Marks']) / len(df)

92.14285714285714

In [40]:
df['Marks'].mean()

92.14285714285714

In [41]:
df['Marks'].min()

83

In [42]:
df['Marks'].max()

99

# 13. Apply Method

In [45]:
# My own function or method
def marks_dividation(i):
    return i/2

In [46]:
df['Marks'].apply(marks_dividation) # Do not use function perameter

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [49]:
# Add new column or result
df['Half Marks'] = df['Marks'].apply(marks_dividation)
df

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [52]:
# Using lambda method
df['Marks'].apply(lambda i:i//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [54]:
df['Half Int Marks'] =  df['Marks'].apply(lambda i:i//2)
df

      Name  Marks  Gender  Half Marks  Half Int Marks
0  Priyang     98    Male        49.0              49
1   Aadhya     89  Female        44.5              44
2   Krisha     99  Female        49.5              49
3   Vedant     87    Male        43.5              43
4   Parshv     90    Male        45.0              45
5   Mittal     83  Female        41.5              41
6  Archana     99  Female        49.5              49

# 14. Map Function

In [70]:
# Convert Male = 1 And Frmale = 0
df['Gender'].map({1: 'Male', 0 : 'Female'})

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
Name: Gender, dtype: object

In [69]:
df['Gender'] = df['Gender'].map({1: 'Male', 0 : 'Female'})
df

      Name  Marks Gender  Half Marks  Half Int Marks  Male_Gender
0  Priyang     98    NaN        49.0              49          NaN
1   Aadhya     89    NaN        44.5              44          NaN
2   Krisha     99    NaN        49.5              49          NaN
3   Vedant     87    NaN        43.5              43          NaN
4   Parshv     90    NaN        45.0              45          NaN
5   Mittal     83    NaN        41.5              41          NaN
6  Archana     99    NaN        49.5              49          NaN

# 15. Drop the Columns

In [81]:
df

      Name  Marks  Half Marks  Half Int Marks  Male_Gender
0  Priyang     98        49.0              49          NaN
1   Aadhya     89        44.5              44          NaN
2   Krisha     99        49.5              49          NaN
3   Vedant     87        43.5              43          NaN
4   Parshv     90        45.0              45          NaN
5   Mittal     83        41.5              41          NaN
6  Archana     99        49.5              49          NaN

In [82]:
df.drop('Male_Gender', axis=1)

      Name  Marks  Half Marks  Half Int Marks
0  Priyang     98        49.0              49
1   Aadhya     89        44.5              44
2   Krisha     99        49.5              49
3   Vedant     87        43.5              43
4   Parshv     90        45.0              45
5   Mittal     83        41.5              41
6  Archana     99        49.5              49

# 16. Print Name of the Columns

In [84]:
df.columns

Index(['Name', 'Marks', 'Half Marks', 'Half Int Marks', 'Male_Gender'], dtype='object')

In [85]:
df.index

RangeIndex(start=0, stop=7, step=1)

# 17. Sort The DataFrame As Per The Marks Column

In [86]:
df.sort_values(by="Marks")

      Name  Marks  Half Marks  Half Int Marks  Male_Gender
5   Mittal     83        41.5              41          NaN
3   Vedant     87        43.5              43          NaN
1   Aadhya     89        44.5              44          NaN
4   Parshv     90        45.0              45          NaN
0  Priyang     98        49.0              49          NaN
2   Krisha     99        49.5              49          NaN
6  Archana     99        49.5              49          NaN

# 18. Display Name & Marks of the Female Students

In [87]:
# Add Gender Columns
df['Gender'] = ['Male','Female','Female','Male','Male',
                         'Female','Female']

In [88]:
df

      Name  Marks  Half Marks  Half Int Marks  Male_Gender  Gender
0  Priyang     98        49.0              49          NaN    Male
1   Aadhya     89        44.5              44          NaN  Female
2   Krisha     99        49.5              49          NaN  Female
3   Vedant     87        43.5              43          NaN    Male
4   Parshv     90        45.0              45          NaN    Male
5   Mittal     83        41.5              41          NaN  Female
6  Archana     99        49.5              49          NaN  Female

In [89]:
df['Male_Gender'] = df['Gender'].map({'Male' : 1, 'Female' : 0})
df

      Name  Marks  Half Marks  Half Int Marks  Male_Gender  Gender
0  Priyang     98        49.0              49            1    Male
1   Aadhya     89        44.5              44            0  Female
2   Krisha     99        49.5              49            0  Female
3   Vedant     87        43.5              43            1    Male
4   Parshv     90        45.0              45            1    Male
5   Mittal     83        41.5              41            0  Female
6  Archana     99        49.5              49            0  Female

In [92]:
df[df['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99